/*Во играта Бинго по редослед се извлекуваат непознат број броеви со вредности помеѓу 1 и 90.
Секогаш се извлекуваат повеќе од 8 броја. Претпоставете дека внесувањето престанува кога ќе се внесе број кој не е во опсегот вредности.
Освен главната добивка, играчите играат и на џокер број. Џокер бројот се формира на следниот начин:
Се слепуваат помалку значајните цифри од првите 7 извлечени броја, и на тој број се додаваат сите следни внесени броеви.
Ваша задача е да го отпечатите така добиениот џокер број.*/
#include <stdio.h>
int main(){
int i=0, joker=0, broj;
while (1){
scanf("%d", &broj);
i++;
if (broj<1||broj>90) break;
else {
    if (i<=7) joker=joker*10+broj%10;
    else joker+=broj;
}
}
printf("%d",joker);
return 0;
}

