/*Да се напише програма каде од тастатура ќе се внесе еден број кој има пет цифри, но не мора да е петцифрен, како на пример 04569 или 00256.
Програмата ги печати сумите на паровите цифри од надвор кон внатре, за на крај да ја испечати средишната цифра. Така, ако внесениот број е 12596, програмата враќа 7 11 5.*/

#include <stdio.h>
int main(){
    int n, cifri[4]={0};
    scanf("%d", &n);
    if (n==0)
        printf("0 0 0");
    else{
    for (int i=4; n>0; i--){
        cifri[i]=n%10;
        n/=10;
    }
    for (int i=0; i<2; i++)
    printf("%d ", cifri[i]+cifri[4-i]);
    printf("%d", cifri[2]);
    }
return 0;
    }
