/*Од тастатура се внесува четирицифрен број n што во себе содржи барем 2 цифри со вредност 5.
КОЛЕГА на тој број е бројот кој на позициите на кои има петки во првиот број ќе има шестка во бројот КОЛЕГА. (Пр. колега на 5551 е 6661).
На екран да се испечати за колку проценти едниот број е поголем/помал од другиот број. Да се има во предвид дека некогаш може да биде поголем бројот n , а некогаш неговиот колега.
Доколку бројот n не содржи најмалку 2 цифри петки, да се испечати порака за грешка како во тест примерите.*/
#include <stdio.h>
int main(){
int n, a[4], b[4], br=0;
scanf("%d", &n);
float x=n;
for (int i=3; i>=0; i--){
    a[i]=n%10;
    if (a[i]==5) {
            b[i]=6;
            br++;}
    else b[i]=a[i];
    n/=10;
}
if (br<2) printf("Error");
else {
    int kolega=1000*b[0]+100*b[1]+10*b[2]+b[3];
    printf("%.4f%%", ((kolega-x)*100.0)/x);
}
return 0;
}
