/*Од тастатура се внесува четирицифрен број n што во себе содржи барем 2 цифри со вредност 5.
КОЛЕГА на тој број е бројот кој на позициите на кои има петки во првиот број ќе има шестка во бројот КОЛЕГА. (Пр. колега на 5551 е 6661).
На екран да се испечати за колку проценти едниот број е поголем/помал од другиот број. Да се има во предвид дека некогаш може да биде поголем бројот n , а некогаш неговиот колега.
Доколку бројот n не содржи најмалку 2 цифри петки, да се испечати порака за грешка како во тест примерите.*/
#include <stdio.h>
int main(){
int n, i=0, p=0;
scanf("%d",&n);
int m=n, k=n;
while (n>0){
    if (n%10==5){
        m+=pow(10,i);
        p++;}
n/=10;
i++;
}
if (p>=2) printf("%.4f%%", ((m-k)*100.0)/k);
else printf("Error");
return 0;
}
