/*Во една компанија сите вработени користат еден централизиран систем, за кој им е креирана корисничка сметка. Корисничко име(username) на секој вработен се добива откако од матичниот број на вработениот ќе се земат деловите кои го даваат датумот на раѓање и ќе се пресмета вредноста:

ден * 100 + месец * 1000 + година
Така ако делот од матичниот број кој го дава датумот е 1103998, тогаш се добива 11 * 100 + 3 * 1000 + 1998 = 6098.

Доколку бројот кој ќе се добие по пресметката е петцифрен, тогаш тоа е корисничкото име.

Во спротивно, доколку е четирицифрен, тогаш се додава првата цифра да биде:

7 - доколку годината на раѓање е до 1960
8 - доколку годината на раѓање е помеѓу 1961 - 1980
9 - доколку годината на раѓање е помеѓу 1981 - 1999*/
#include <stdio.h>
int main(){
int embg, a[3];
scanf("%d", &embg);
int den=embg/100000, mesec=(embg/1000)%100;
for (int i=0; i<3; i++) {
        a[i]=embg%10;
        embg/=10;}
int godina=a[0]+a[1]*10+a[2]*100+1000;
int username=100*den+1000*mesec+godina;
if (username>=10000) printf("%d", username);
else{
if (godina<=1960) printf("%d", username+70000);
    else if (godina<=1980) printf("%d", username+80000);
        else printf("%d", username+90000);
return 0;
}}
