/*Благ број е број што е составен само од парни цифри (0, 2, 4, 6, 8).
Во зададен опсег (почетокот m и крајот на опегот n се цели броеви чија вредност се внесува од тастатура),
да се најде и испечати најмалиот „благ број“. Ако не постои таков број, да се испечати NE.*/
#include <stdio.h>
int blag(int n){
    while (n>0){
        if (n%10%2) return 0;
        n/=10;
    }
return 1;
}
int main()
{
    int n, m, b=0;
    scanf("%d %d",&n, &m);
    for (int i=n; i<=m; i++){
        if (blag(i)){
            printf("%d", i);
            b=1;
            return 0;
        }
    }
    printf("NE");
    return 0;
}

