/*Благ број е број што е составен само од парни цифри (0, 2, 4, 6, 8).
Во зададен опсег (почетокот m и крајот на опегот n се цели броеви чија вредност се внесува од тастатура),
да се најде и испечати најмалиот „благ број“. Ако не постои таков број, да се испечати NE.*/
#include <stdio.h>
int main(){
    int n, m, blag, k, j;
    scanf("%d %d", &n, &m);
    for (int i=n; i<=m; i++){
        int k=j=i;
        blag=1;
        while (j>0){
            if ((j%10)%2!=0){
                blag=0;
                break;}
            else j/=10;
        }
        if (blag!=0){
            printf("%d", k);
            break;
        }
    }
if (blag==0) printf("NE");
return 0;
    }
