/*Да се напише рекурзивна функција која што прима еден аргумент број x која што ќе враќа 1 доколку секоја цифра во бројот е помала
од предходната, а во спротивно 0.Од стандарден влез се вчитува прво број N, а потоа N броеви. За секој број да се испечати 1 или 0
(во нов ред), доколку бројот е опаѓачки или не е опаѓачки.*/
#include <stdio.h>
int Opagacki (int n){
if (n<10) return 1;
if ((n/10)%10<=n%10) return 0;
Opagacki(n/10);
}

int main(){
int n, a;
scanf("%d", &n);
for (int i=0; i<n; i++){
    scanf("%d", &a);
    printf("%d\n", Opagacki(a));
}
return 0;
}
