/*Да се напише рекурзивна функција која што прима еден аргумент - број x која што ќе враќа 1 доколку секоја цифра во бројот е
поголема од претходната, а во спротивно 0. Од стандарден влез се вчитува прво број N, а потоа N броеви. За секој број да се
испечати порака DA или NE (во нов ред), доколку бројот е растечки или не е растечки.*/
#include <stdio.h>
int f(int n, int p){
if (n<10) return 1;
if (n%10<=(n/10)%10) return 0;
f(n/10,p);
}
int main(){
int n, a;
scanf("%d", &n);
for (int i=0; i<n; i++){
scanf("%d",&a);
if (f(a,1)) printf("DA\n");
else printf("NE\n");
}
return 0;
}
