/*Да се напише програма во која во даден опсег на природни броеви [m,n], ќе се најдат и отпечатат во нов ред сите броеви за кои важи дека збирот на бројот со неговата слика
(број кој ги има истите цифри, но во обратен редослед) е помал или еднаков на двојната вредност на бројот. На крај да се отпечати и бројот на вакви броеви.*/
#include <stdio.h>
int slika(int n){
int sl=0;
while (n>0){
    sl=(sl*10)+n%10;
    n/=10;
}
return sl;
}
int main(){
int a, b, br=0;
scanf("%d %d", &a, &b);
for (int i=a; i<=b; i++){
    if (i+slika(i)<=2*i){
        printf("%d\n", i);
        br++;}
}
printf("Vkupno: %d", br);
return 0;
}
