/*За квадратна матрица А со димензии n x n, од стандарден влез се внесува бројот n (n > 2) и елементите на матрицата (реални
броеви). Нека X e збирот од елементите под главната дијагонала во матрицата А. Нека Y е збирот од елементите под споредната дијагонала во матрицата А. Да се креира нова матрица B на следниот начин:
сите елементи од главната дијагонала во матрицата B треба да имаат вредност X
сите елементи од споредната дијагонала во матрицата B треба да имаат вредност Y
ако даден елемент припаѓа и на главната и на споредната дијагонала во матрицата B, тогаш неговата вредност e X+Y
сите останати елементи во матрицата B имаат вредност 0
Новата матрица B да се испечати на стандарден излез.*/
#include <stdio.h>
#include <stdlib.h>
#include <math.h>
int main () {
    int n;
    scanf("%d", &n);
    float a[n][n], b[n][n], glavna=0, sporedna=0;
    for (int i=0; i<n; i++)
        for (int j=0; j<n; j++){
            scanf("%f", &a[i][j]);
            b[i][j]=0;
            if (i>j) glavna+=a[i][j];
            if (i+j+1>n) sporedna+=a[i][j];
        }
     for (int i=0; i<n; i++){
        for (int j=0; j<n; j++)
        {
            if(i==j) b[i][j]+=glavna;
            if(i+j==n-1) b[i][j]+=sporedna;
            printf("%.1f ", b[i][j]);
        }
        printf("\n");
    }
    return 0;
}
