/*Да се напише рекурзивна функција за наоѓање на максималната цифра од даден цел број.
Од стандарден влез се внесуваат непознат број цели броеви се додека не се внесе нешто што не е број.
За секој од нив да се испечати максималната цифра во посебен ред.*/
#include <stdio.h>

int maxcifra(int n){
if (n<=0) return 0;
return n%10>maxcifra(n/10)?n%10 : maxcifra(n/10);
}

int main () {
    int n;
    while (scanf("%d", &n)){
        printf("%d\n", maxcifra(n));
    }
    return 0;
}
