/*Oд стандарден влез се вчитува еден цел број X, димензии на матрица M и N (цели броеви), како и елементите на матрицата со
димензии M x N (цели броеви). Да се напише програма што ќе ги промени редиците на матрицата на следниот начин:
Ако збирот на елементите од редот е поголем од X, елементите на тој ред добиваат вредност 1
Ако збирот на елементите од редот е помал од X, елементите на тој ред добиваат вредност -1
Ако збирот на елементите од редот е еднаков на X, елементите на тој ред добиваат вредност 0
Променетата матрица да се испечати на екран.*/
#include <stdio.h>

int main () {
    int n, m, x;
    scanf("%d", &x);
    scanf("%d %d", &n, &m);
    int a[n][m], suma[n];
    for (int i = 0; i < n; i++)
        suma[i]=0;
    for (int i = 0; i < n; i++)
        for (int j = 0; j < m; j++){
            scanf("%d", &a[i][j]);
            suma[i]+=a[i][j];}
    for (int i = 0; i < n; i++){
        if (suma[i]==x){
            for (int j = 0; j < m; j++)
                printf("0 ");
                printf("\n");}
        else if (suma[i]>x){
            for (int j = 0; j < m; j++)
                printf("1 ");
                printf("\n");}
        else{
            for (int j = 0; j < m; j++)
                printf("-1 ");
        printf("\n");}
    }
    return 0;
}
