/*Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата). Притоа самиот елемент кој ја дели матрицата
припаѓа во четвртиот квадрант. Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100). Потоа се внесуваат два
броеви кои претставуваат индекси на еден елемент од матрицата. Да се најдат сумите на секој од квадрантите и да се испечатат на
стандарен излез. Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот. Доколку не може
да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.*/
#include <stdio.h>

int main()
{
    int n, m, indi, indj, s[5]={0};
    scanf("%d %d",&n, &m);
    int a[n][m];
    for (int i=0; i<n; i++)
        for (int j=0; j<m; j++)
            scanf("%d", &a[i][j]);
    scanf("%d %d",&indi, &indj);
    for (int i=0; i<n; i++)
        for (int j=0; j<m; j++){
            if (i<indi)
            {
                if(j<indj) s[1]+=a[i][j];
                else s[2]+=a[i][j];}
            else{
                if(j<indj) s[3]+=a[i][j];
                else s[4]+=a[i][j];}
            }
    for (int i=1; i<5; i++) printf("%d ",s[i]);
    return 0;
}
