/*Да се напише програма во која се вчитува матрица (со димензии M и N, 1 < M,N <= 100) од цели броеви. Сите елементи од матрицата
се поставени на вредност 0 или 1. Да се формира нова матрица така што на местото на сите елементи што имаат вредност 0, треба да
се смести бројот на елементи со вредност 1 околу тој елемент во сите осум насоки. Новодобиената матрица да се отпечати на
стандарден излез, при што наместо елементите со вредност 1 од оригиналната матрица ќе се отпечати знак *.*/
#include <stdio.h>
int main(){
int n, m, c;
scanf("%d %d", &n, &m);
int matrix[n][m];
for (int i=0; i<n; i++)
    for (int j=0; j<m; j++)
        scanf("%d", &matrix[i][j]);

for (int i=0; i<n; i++){
    for (int j=0; j<m; j++){
        if (matrix[i][j]) printf("* ");
        else {
        c=0;
        if (i>=1){
            if (matrix[i-1][j]) c++;
            if(j>=1) if (matrix[i-1][j-1]) c++;
            if (j<m-1) if (matrix[i-1][j+1]) c++;
        }
        if (i<n-1){
                if (matrix[i+1][j]) c++;
                if (j>=1) if (matrix[i+1][j-1]) c++;
                if (j<m-1) if (matrix[i+1][j+1]) c++;
        }
        if (j>=1) if (matrix[i][j-1]) c++;
        if (j<m-1) if (matrix[i][j+1]) c++;
        printf("%d ", c);
        }}
printf("\n");}
return 0;
}
