/*Од стандарден влез се чита позитивен број n кој ги дава димензиите на квадратна матрица од цели броеви, која се чита во продолжение. Да се напише програма која за таа матрица
(макс. 100 x 100) ќе ја испечати должината на најдолгата строго растечка подниза, доколку матрицата ја гледаме ред по ред.*/
#include <stdio.h>
int main(){
int n, max=1, d=1;
scanf("%d", &n);
int a[n][n];
for (int i=0; i<n; i++)
    for (int j=0; j<n; j++)
        scanf("%d", &a[i][j]);
for (int i=0; i<n; i++){
    d=1;
for (int j=1; j<n; j++)
    {
        if (a[i][j]>a[i][j-1])
            d++;
        else
        {
            if (d>max)
                max=d;
           d=1;
        }
        if (d>max) max=d;
    }
}
printf("%d\n", max);
return 0;
}
