/*Од стандарден влез се чита цел број N. Потоа се вчитуваат N низи од цели броеви (со максимална должина од 100 елементи),
при што за секоја прво се внесува должината на низата, а потоа сите елементи на низата. Да се напише програма која за секоја низа
ќе го испечати процентот на огледални еднакви броеви во низата. Огледални броеви во низа се првиот и последниот, вториот и
претпоследниот итн. Доколку низата има непарен број на елементи, средниот елемент е и огледален и еднаков.*/
#include <stdio.h>
int main(){
int n, m;
scanf("%d", &n);
for (int i=0; i<n; i++){
        scanf("%d", &m);
    int a[m], k=0;
    for (int i=0; i<m; i++)
                scanf("%d", &a[i]);
for (int i=0; i<m/2; i++)
        if (a[i]==a[m-i-1]) k+=2;
if (m%2) k++;
printf("%.2f%%\n", 100.0*k/m);
}
return 0;
}
