/*За дадена низа од N големина, исчитајте ја истата и потоа: Испечатете ја во нејзината оригинална форма; Сменете го распоредот
на низата во обратна насока; Отстранете го секој втор член; Повторно сменете го распоредот на низата во обратна насока*/
#include <stdio.h>
int main(){
int n;
    scanf("%d",&n);
    int a[n];
    for (int i=0; i<n; i++) scanf("%d",&a[i]);
    for (int i=n-1; i>=0; i--)
    printf("%d ", a[i]);
    printf("\n");
    for (int i=n-1, k=1; i>=0; i--,k++)
    if (k%2) printf("%d ",a[i]);
    printf("\n");
    for (int i=0, k=1; i<n; i++,k++)
    if (k%2) printf("%d ",a[i]);
    return 0;
}

